In [1]:
# import Pandas as pd
import pandas as pd

# create a new data frame
df = pd.DataFrame({'Name': ['1. John peterson  Larter(1994)', '2. Robert Junior paresh(1954)', '3. Jonny jonny Depp(1968)']})

print("Given Dataframe is :\n",df)

Given Dataframe is :
                              Name
0  1. John peterson  Larter(1994)
1   2. Robert Junior paresh(1954)
2       3. Jonny jonny Depp(1968)

In [2]:
# splitting the string from fullstop.
s=df['Name'].str.split(pat='.',expand = True)
s

   0                             1
0  1   John peterson  Larter(1994)
1  2    Robert Junior paresh(1954)
2  3        Jonny jonny Depp(1968)

In [3]:
#assigning name to column
df['sr_no']= s[0]
df['Movie_Name']= s[1]

In [4]:
# dropping the orignal column
df.drop('Name',axis=1,inplace=True)
df

  sr_no                    Movie_Name
0     1   John peterson  Larter(1994)
1     2    Robert Junior paresh(1954)
2     3        Jonny jonny Depp(1968)

In [5]:
#Extracting year from column 
year=df['Movie_Name'].str[-5:-1]
df['Year'] = year

In [6]:
df

  sr_no                    Movie_Name  Year
0     1   John peterson  Larter(1994)  1994
1     2    Robert Junior paresh(1954)  1954
2     3        Jonny jonny Depp(1968)  1968

In [7]:
# seperating the name from number 
df['Movie_Name'] = df['Movie_Name'].str.replace(r"\s*\([^()]*\)", "", regex=True).str.strip()
df

  sr_no             Movie_Name  Year
0     1  John peterson  Larter  1994
1     2   Robert Junior paresh  1954
2     3       Jonny jonny Depp  1968